001=-491.556,-266.009,-285.619,244.067,0,0,1,0,0,0=圆盘mark点1安全位坐标拍Mark11
002=0=圆盘mark点1坐标
003=-147.53,692.366,-283.333,1.04939,0,0,1,0,0,0=圆盘mark点2安全坐标
004=-135.1,706.326,-283.333,-2.04939,0,0,1,0,0,0=圆盘mark点2坐标
005=-137.845,678.736,-283.333,3.0485992,0,0,1,0,0,0=圆盘mark点3安全坐标
006=-138.606,659.05,-283.333,96.0486,0,0,1,0,0,0=圆盘mark点3坐标
007=-138.608,662.049,-283.333,96.0481,0,0,1,0,0,0=圆盘mark点4安全坐标
008=-513.516,-613.611,-58.4428,249.352,0,0,1,0,0,0=圆盘mark点4坐标
009=64.8025,871.932,-49.6686,188.61,0,0,1,0,0,0=圆盘mark点5安全坐标
010=64.8025,871.932,-109.668,188.61,0,0,1,0,0,0=圆盘mark点5坐标
011=-55.1969,871.932,-109.668,188.609,0,0,1,0,0,0=圆盘mark点6安全坐标
012=-55.1969,871.932,-49.6686,188.609,0,0,1,0,0,0=圆盘mark点6坐标
013=-175.197,811.933,-49.6686,188.61,0,0,1,0,0,0=圆盘mark点7安全坐标
014=-175.197,811.933,-109.668,188.61,0,0,1,0,0,0=圆盘mark点7坐标
015=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点8安全坐标
016=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点8坐标
017=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点9安全坐标
018=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点9坐标
019=63.6159,492.631,-318.168,130.354,0,0,1,0,0,0=圆盘mark点10安全坐标
020=62.6161,487.631,-318.168,130.353,0,0,1,0,0,0=圆盘mark点10坐标拍照1RR标定坐标
021=99.2203,564.201,-318.168,188.838,0,0,1,0,0,0=圆盘mark点11安全坐标
022=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点11坐标
023=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点12安全坐标
024=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点12坐标
025=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点13安全坐标
026=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点13坐标
027=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点14安全坐标
028=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点14坐标
029=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点15安全坐标
030=-590.07,417.849,-24.618,331.069,0,0,1,0,0,0=圆盘mark点15坐标
031=409.927,817.847,-74.6183,331.07,0,0,1,0,0,0=圆盘mark点16安全坐标
032=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点16坐标
033=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点17安全坐标
034=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点17坐标
035=394.8,771.933,-59.668,188.609,0,0,1,0,0,0=圆盘mark点18安全坐标
036=46446=圆盘mark点18坐标
037=234.802,761.932,-39.6677,188.61,0,0,1,0,0,0=圆盘mark点19安全坐标
038=234.802,761.932,-139.668,188.61,0,0,1,0,0,0=圆盘mark点19坐标
039=164.8,811.932,-49.6686,188.61,0,0,1,0,0,0=圆盘mark点20安全坐标
040=164.8,811.932,-119.667,188.61,0,0,1,0,0,0=圆盘mark点20坐标
041=64.8025,871.932,-49.6686,188.61,0,0,1,0,0,0=圆盘mark点21安全坐标
042=-665.505,-272.064,-267.614,334.082,0,0,1,0,0,0=圆盘mark点21坐标
043=-55.1969,871.932,-109.668,188.609,0,0,1,0,0,0=圆盘mark点22安全坐标
044=-665.505,-272.064,-267.614,334.082,0,0,1,0,0,0=圆盘mark点22坐标
045=-665.505,-272.064,-237.614,334.082,0,0,1,0,0,0=圆盘mark点23安全坐标bfdgdgh
046=-175.197,811.933,-109.668,188.61,0,0,1,0,0,0=圆盘mark点23坐标
047=-664.024,233.327,-301.068,0.484978,0,0,1,0,0,0=圆盘mark点24安全坐标离开基准位
048=570.334,613.754,-69.475,-0.00076294,0,0,1,0,0,0=圆盘mark点24坐标
049=-643.023,125.325,-411.068,0.486458,0,0,1,0,0,0=圆盘mark点25安全坐标
050=-665.505,-272.064,-147.613,334.083,0,0,1,0,0,0=圆盘mark点25坐标上料校准位
051=-665.505,-272.064,-187.618,244.069,0,0,1,0,0,0=圆盘mark点26安全坐标吸料位
052=-665.505,-272.064,-277.617,334.069,0,0,1,0,0,0=圆盘mark点26坐标基准取料位基准位
053=-665.505,-272.064,-287.618,244.069,0,0,1,0,0,0=圆盘mark点27安全坐标
054=-665.505,-272.064,-287.618,334.069,0,0,1,0,0,0=圆盘mark点27坐标
055=-608.506,-192.063,-287.618,244.068,0,0,1,0,0,0=圆盘mark点28安全坐标mark1
056=-548.504,-267.064,-287.618,244.068,0,0,1,0,0,0=圆盘mark点28坐标222
057=-608.506,-267.064,-287.618,244.069,0,0,1,0,0,0=圆盘mark点29安全坐标
058=-315.016,-458.713,-347.02,244.068,0,0,1,0,0,0=aaaaaaaaaaaaaaaaaaa
059=-409.724,-659.601,-71.619,244.067,0,0,1,0,0,0=圆盘mark点30安全坐标圆圆圆圆
060=-421.62,-649.902,-71.619,244.068,0,0,1,0,0,0=圆盘mark点30坐标11111
061=-319.056,-457.613,-347.02,244.069,0,0,1,0,0,0=圆盘mark点31安全坐标0000
062=-558.593,73.4764,-352.069,450.612,0,0,1,0,0,0=圆盘mark点31坐标气缸1
063=-604.641,109.745,-378.01,274.073,0,0,1,0,0,0=圆盘mark点32安全坐标上料校准11
064=-651.766,108.197,-381.425,272.921,0,0,1,0,0,0=圆盘mark点32坐标
065=-604.641,114.746,-380.01,270.61,0,0,1,0,0,0=上料位校准标定位
066=-545.593,63.9753,-340.069,270.613,0,0,1,0,0,0=上料位取料基准安全位
067=-545.593,63.9753,-360.468,270.613,0,0,1,0,0,0=上料位取料基准位
068=-551.765,408.198,-300.425,272.921,0,0,1,0,0,0=离开上料取料位
069=-463.222,-667.433,-76.6187,336.069,0,0,1,0,0,0=圆盘mark点17坐标放料坐标
070=-554.023,408.326,-351.068,270.485,0,0,1,0,0,0=旋转90度气缸2离开位
071=-665.023,122.325,-340.069,270.485,0,0,1,0,0,0=旋转90度气缸2上料基准安全位
072=-665.023,122.325,-358.068,270.485,0,0,1,0,0,0=旋转90度气缸2上料基准位
073=-140.024,533.327,-326.068,0.482819,0,0,1,0,0,0=放料标定位
074=-140.024,533.327,-326.068,0.480713,0,0,1,0,0,0=拍照位
075=-408.555,-384.009,-11.6196,244.069,0,0,1,0,0,0=上面过度安全位AAAAAAAAAAAAAA
076=-402.721,-667.602,-71.619,244.069,0,0,1,0,0,0=拍照位1-2气缸3
077=-491.721,-624.603,-71.619,244.069,0,0,1,0,0,0=拍照位1-1气缸3
078=-462.069,-668.154,-72.6178,335.069,0,0,1,0,0,0=放料位1-1气缸3
079=-468.069,-664.854,-70.1172,335.068,0,0,1,0,0,0=放料位1-1上方气缸3
080=-628.799,-303.095,-323.198,253.908,0,0,1,0,0,0=安全位1
081=-628.799,-303.095,-3.1975,253.908,0,0,1,0,0,0=安全位1上方
082=-508.798,-523.095,-3.1975,253.908,0,0,1,0,0,0=安全位2
083=-125.307,460.66,-145.068,258.212,0,0,1,0,0,0=下相机拍照位
084=-296.071,-720.154,-74.6183,244.07,0,0,1,0,0,0=拍照位2-1气缸3
085=-207.072,-763.154,-74.6183,244.07,0,0,1,0,0,0=拍照位2-2气缸3
086=-393.056,-429.614,-347.02,244.068,0,0,1,0,0,0=拍照位3-1气缸3
087=-304.056,-472.614,-347.02,244.069,0,0,1,0,0,0=拍照位3-2气缸3
088=-202.074,-524.154,-352.621,243.668,0,0,1,0,0,0=拍照位4-1气缸3
089=-113.075,-567.153,-352.621,243.668,0,0,1,0,0,0=拍照位4-2气缸3
090=-302.483,-472.703,-352.02,243.849,0,0,1,0,0,0=圆盘mark点17坐标00000
091=-466.723,-662.603,-71.6195,334.069,0,0,1,0,0,0=放料位基准1气缸3
092=-495.723,-619.602,-71.619,246.069,0,0,1,0,0,0=Mark1-1
093=-561.054,701.386,-70.0195,153.978,0,0,1,0,0,0=拍照位5-1气缸3
094=-619.055,620.384,-70.0195,153.978,0,0,1,0,0,0=拍照位5-2气缸3
095=-368.055,-464.616,-347.02,333.978,0,0,1,0,0,0=放料位3基准位气缸3
096=-558.593,72.9765,-340.069,360.611,0,0,1,0,0,0=上料位取料基准安全位气缸1
097=-558.593,72.9765,-358.069,360.609,0,0,1,0,0,0=上料位取料基准位气缸1
098=-564.592,57.9757,-340.069,449.413,0,0,1,0,0,0=上料位取料基准安全位气缸2
099=-564.592,57.9757,-356.069,449.413,0,0,1,0,0,0=上料位取料基准位气缸2
100=-406.72,-362.603,-21.619,244.067,0,0,1,0,0,0=圆盘mark点17坐标AQW44
101=-304.056,-472.614,-47.02,244.069,0,0,1,0,0,0=圆盘mark点17坐标
102=102.026,560.468,-318.168,194.28,0,0,1,0,0,0=123123
